<template>
  <div class="home">        
    <v-container>
      <h1>Tailwind CSS</h1> 

      <h2>1. Tailwind CSS 소개</h2>

      <p>
        Tailwind CSS는 효율적인 스타일링과 높은 커스터마이징 가능성을 필요로 하는 현대 웹 개발 환경에서 매우 유용한 도구입니다. 직관적인 클래스 기반 접근 방식, 반응형 디자인 지원, 그리고 가벼운 최종 빌드 파일로 인해 많은 개발자들이 Tailwind CSS를 선호하고 있으며, 빠르게 성장하는 커뮤니티와 함께 지속적으로 발전하고 있습니다. Tailwind CSS는 웹 개발자들에게 유연성과 생산성을 동시에 제공하는 강력한 CSS 프레임워크입니다.
      </p>

      <p>
        전통적인 CSS 프레임워크와 달리 Tailwind CSS는 미리 정의된 컴포넌트나 스타일을 제공하는 것이 아니라, 클래스 기반의 유틸리티를 통해 스타일을 직접 작성할 수 있게 해줍니다. 이로 인해 사용자는 HTML 요소에 직접 클래스 이름을 지정하여 스타일을 커스터마이징할 수 있습니다. Tailwind CSS는 사용자가 필요로 하는 모든 스타일을 작성할 수 있도록 수천 개의 유틸리티 클래스를 제공하여, 매우 세부적인 디자인 컨트롤이 가능합니다.
      </p>

      <h2>2. Tailwind CSS의 주요 특징</h2>

      <h3>1) 유틸리티 퍼스트 프레임워크</h3>
      <p>
        Tailwind CSS는 유틸리티 퍼스트(Utility-First) 프레임워크로, CSS 속성을 나타내는 클래스들을 제공하여 개발자가 코드베이스를 효율적으로 유지하고 스타일을 빠르게 적용할 수 있게 해줍니다.
      </p>

      <h3>2) 직관적이고 간결한 클래스 구조</h3>
      <p>
        Tailwind CSS의 유틸리티 클래스는 직관적인 이름을 가지고 있어 코드 가독성이 높습니다. 개발자는 클래스 이름만 보고도 스타일이 어떤 역할을 하는지 쉽게 이해할 수 있습니다.
      </p>

      <h3>3) 반응형 디자인 지원</h3>
      <p>
        Tailwind CSS는 미디어 쿼리 없이도 반응형 디자인을 쉽게 구현할 수 있도록 다양한 반응형 유틸리티 클래스를 제공합니다. sm:, md:, lg:, xl: 등의 프리픽스를 사용하여 다양한 디바이스 크기에 맞춰 스타일을 설정할 수 있습니다.
      </p>

      <h3>4) 사용자 정의 가능성</h3>
      <p>
        Tailwind CSS는 매우 유연하고 사용자 정의가 용이합니다. 개발자는 프로젝트의 요구에 맞게 Tailwind의 기본 설정 파일을 수정하여 색상, 크기, 폰트 등을 커스터마이징할 수 있습니다. 또한, 사용하지 않는 유틸리티 클래스는 제거하여 최종 CSS 파일의 크기를 최소화할 수 있습니다.
      </p>

      <h3>5) 재사용 가능한 스타일링 패턴</h3>
      <p>
        Tailwind CSS는 일관된 디자인 시스템을 쉽게 구축할 수 있게 해줍니다. 공통 유틸리티 클래스를 사용하여 다양한 컴포넌트를 빠르게 제작하고, 이를 재사용함으로써 스타일링의 일관성을 유지할 수 있습니다. 이 접근 방식은 디자인 시스템의 개발 속도를 높이고, CSS 코드의 중복을 줄이는 데 도움이 됩니다.
      </p>

      <h3>6) 가벼운 최종 빌드 파일</h3>
      <p>
        Tailwind CSS는 빌드 프로세스를 통해 최종 CSS 파일을 생성합니다. 이 파일은 웹 사이트에 필요한 스타일만을 포함하며, 빌드 과정에서 사용되지 않는 스타일은 자동으로 제거됩니다. 이로 인해 웹 사이트의 로딩 속도가 빠르고 효율적입니다.
      </p>

      <h3>7) 커뮤니티와 지원</h3>
      <p>
        Tailwind CSS는 빠르게 성장하는 커뮤니티와 함께 지원을 받고 있습니다. 이로 인해 많은 개발자들이 프레임워크를 사용하여 문제를 해결하고 새로운 기능을 추가할 수 있습니다.
      </p>      

    </v-container>
  </div>
</template>

<script>
  
</script>

<style scoped lang="scss">
  h1{
    font-size: 4rem;
    text-align: center;
    margin: 50px 0;
  }
  h2{
    font-size: 3rem;
    font-weight: 700;
    margin-top: 80px;
    margin-bottom: 30px;
  }
  h3{
    font-size: 2rem;
    font-weight: 700;
    margin-bottom: 10px;
  }
  p{
    font-size: 1.8rem;
    line-height: 1.5;
    margin-bottom: 30px;
  }
  h3+p{
    margin-bottom: 50px;
  }
</style>